service/ruby-on-rails/app/views/lists/show.html.erb

SELECT "tasks".* FROM "tasks" WHERE "tasks"."list_id" = $1  [["list_id", "a34f9d99-37b3-4506-92f0-6b882ccb840a"]]
---
<ul>
  <% @list.tasks.each do |task| %>