service/ruby-on-rails/app/views/accounts/show.html.erb

<ul>
  <% @account.lists.each do |list| %>
---
SELECT "lists".* FROM "lists" WHERE "lists"."account_id" = $1  [["account_id", "fc7e18a0-87c7-4db6-ac4d-16215e1b2de4"]]