service/ruby-on-rails/app/controllers/accounts_controller.rb

  def create
    @account = Account.new(account_params)

    respond_to do |format|
      if @account.save
---
INSERT INTO "accounts" ("login", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["login", "Arnaud Levy"], ["created_at", "2022-11-09 10:49:45.126813"], ["updated_at", "2022-11-09 10:49:45.126813"]]