service/ruby-on-rails/app/controllers/accounts_controller.rb

  def create
    @account = Account.new(login: params[:login])
    if @account.save
---
INSERT INTO "account" ("login", "creation_date") VALUES ($1, $2) RETURNING "id"  [["login", "Sebou"], ["creation_date", nil]]