service/ruby-on-rails/app/controllers/lists_controller.rb

  def create
    @list = @account.lists.new(params.permit(:name))
    response.headers['Content-Type'] = 'application/json'
    if @list.save
---
INSERT INTO "lists" ("account_id", "name", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["account_id", "fc7e18a0-87c7-4db6-ac4d-16215e1b2de4"], ["name", "Liste 1"], ["created_at", "2022-11-09 13:40:47.302677"], ["updated_at", "2022-11-09 13:40:47.302677"]]

  def load_account
    @account = Account.find(params[:account_id])
---
SELECT "accounts".* FROM "accounts" WHERE "accounts"."id" = $1 LIMIT $2  [["id", "fc7e18a0-87c7-4db6-ac4d-16215e1b2de4"], ["LIMIT", 1]]