service/ruby-on-rails/app/controllers/tasks_controller.rb

INSERT INTO "tasks" ("list_id", "name", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["list_id", "a34f9d99-37b3-4506-92f0-6b882ccb840a"], ["name", "task 1"], ["description", "desc"], ["created_at", "2022-11-09 13:41:38.539581"], ["updated_at", "2022-11-09 13:41:38.539581"]]
---
  def create
    @task = Task.new(task_params)

    respond_to do |format|
      if @task.save