service/ruby-on-rails/app/controllers/tasks_controller.rb

SELECT "lists".* FROM "lists" WHERE "lists"."id" = $1 LIMIT $2  [["id", "a34f9d99-37b3-4506-92f0-6b882ccb840a"], ["LIMIT", 1]]
---
  def load_list
    @list = List.find(params[:list_id])